# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей.
# Дано a, b, c - стороны предполагаемого треугольника.
# Требуется сравнить длину каждого отрезка-стороны с суммой двух других.
# Если хотя бы в одном случае отрезок окажется больше суммы двух других,
# то треугольника с такими сторонами не существует. Отдельно сообщить является ли треугольник
# разносторонним, равнобедренным или равносторонним.

a = int(input('Введите сторону треугольника a: '))
b = int(input('Введите сторону треугольника b: '))
c = int(input('Введите сторону треугольника c: '))

if a + b < c or b + c < a or a + c < b:
    result = f'Треугольника со сторонами {a}, {b}, {c} не существует'
else:
    if a == b == c:
        result = f'Треугольник равносторонний'
    elif a == b or a == c or b == c:
        result = f'Треугольник равнобедренный'
    else:
        result = f'Треугольник разносторонний'
print(result)